app/controllers/heros_controller.rb

    def index
        heroes = Hero.all
---
SELECT "heros".* FROM "heros"

      def show
        hero = Hero.includes(:powers).find_by(id: params[:id])
---
SELECT "hero_powers".* FROM "hero_powers" WHERE "hero_powers"."hero_id" = ?  [["hero_id", 1]]
SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "powers".* FROM "powers" WHERE "powers"."id" IN (?, ?)  [["id", 1], ["id", 2]]